#+STARTUP: fold
* DONE 备份前置参数，包括pm产品
* DONE 回收由于313改为2导致没有路由的单子
* DONE 回退前置 groupMember 错单
* DONE 对账环境前置工单创建及用户赋权（写脚本）
  CLOSED: [2022-04-05 Tue 18:11] SCHEDULED: <2022-04-05 Tue>
  :LOGBOOK:
  CLOCK: [2022-04-05 Tue 16:57]--[2022-04-05 Tue 18:11] =>  1:14
  :END:[
* DONE 对账环境前置数据源问题核查及修改
  CLOSED: [2022-04-05 Tue 16:54] SCHEDULED: <2022-04-05 Tue>
  低级错误，acct3连接串中多打了一个@符号。
* DONE 批量更新信管svn前置工单建表语句（写脚本）
  CLOSED: [2022-04-05 Tue 19:56]
  :LOGBOOK:
  CLOCK: [2022-04-05 Tue 19:36]--[2022-04-05 Tue 19:56] =>  0:20
  CLOCK: [2022-04-05 Tue 19:20]--[2022-04-05 Tue 19:35] =>  0:15
  :END:
* DONE 对账环境新建异动工单表，svn建表语句移到稽核目录下
  CLOSED: [2022-04-05 Tue 20:33]
* DONE 对账环境异动应用问题解决
CLOSED: [2022-04-07 Thu 11:36]
:LOGBOOK:
- State "NEXT"       from "WAITING"    [2022-04-07 Thu 11:32]
CLOCK: [2022-04-07 Thu 11:32]--[2022-04-07 Thu 11:36] =>  0:04
- State "WAITING"    from "TODO"       [2022-04-06 Wed 11:37] \\
  to xuxiang
:END:
* DONE 生产100主机上发布脚本部署到测试和对账环境
CLOSED: [2022-04-06 Wed 15:43]
:LOGBOOK:
CLOCK: [2022-04-06 Wed 13:06]--[2022-04-06 Wed 13:29] =>  0:23
CLOCK: [2022-04-06 Wed 12:11]--[2022-04-06 Wed 12:20] =>  0:09
CLOCK: [2022-04-06 Wed 11:38]--[2022-04-06 Wed 12:01] =>  0:23
:END:
* DONE 更新测试环境所有jar包和配置
CLOSED: [2022-04-06 Wed 16:10]
稽核包未更新
* DONE 测试环境搭建：工单表/前置应用
CLOSED: [2022-04-06 Wed 17:13]
  :LOGBOOK:
  CLOCK: [2022-04-05 Tue 20:47]--[2022-04-05 Tue 21:00] =>  0:13
  :END:

* DONE 了解 Cygwin
CLOSED: [2022-04-07 Thu 11:12]
:LOGBOOK:
CLOCK: [2022-04-07 Thu 11:08]--[2022-04-07 Thu 11:12] =>  0:04
CLOCK: [2022-04-07 Thu 10:53]--[2022-04-07 Thu 11:06] =>  0:13
:END:
* DONE 安装 Manjaro wsl 子系统
CLOSED: [2022-04-07 Thu 13:39]
:LOGBOOK:
CLOCK: [2022-04-07 Thu 13:24]--[2022-04-07 Thu 13:39] =>  0:15
CLOCK: [2022-04-07 Thu 11:37]--[2022-04-07 Thu 12:07] =>  0:30
CLOCK: [2022-04-07 Thu 11:16]--[2022-04-07 Thu 11:32] =>  0:16
:END:
* DONE 部署博客在widowns下的发布环境(manjaro,hugo,sshpass,rsync)
CLOSED: [2022-04-07 Thu 14:37]
:LOGBOOK:
CLOCK: [2022-04-07 Thu 14:26]--[2022-04-07 Thu 14:37] =>  0:11
:END:
* DONE 开启 ManjaroWSL 下的 Gui/Tui Emacs
CLOSED: [2022-04-07 Thu 16:39]
:LOGBOOK:
CLOCK: [2022-04-07 Thu 13:43]--[2022-04-07 Thu 14:17] =>  0:34
:END:
* DONE 修改实时订购和查询服务post请求中datas参数的注解为@RequestBody
CLOSED: [2022-04-07 Thu 16:50]
* DONE GCC编译多文件简单学习
CLOSED: [2022-04-07 Thu 18:00]
:LOGBOOK:
CLOCK: [2022-04-07 Thu 17:38]--[2022-04-07 Thu 17:59] =>  0:21
:END:
* DONE 理清 linkedlist 的 deleteNode 逻辑
CLOSED: [2022-04-08 Fri 11:42] DEADLINE: <2022-04-08 Fri 22:00>
:LOGBOOK:
CLOCK: [2022-04-08 Fri 11:04]--[2022-04-08 Fri 11:42] =>  0:38
:END:
* DONE 设置 windows下的 locale 为英文环境
CLOSED: [2022-04-08 Fri 10:39] SCHEDULED: <2022-04-08 Fri 10:00>
:LOGBOOK:
- Note taken on [2022-04-08 Fri 10:37] \\
  修改设置中的“区域格式”
CLOCK: [2022-04-08 Fri 10:24]--[2022-04-08 Fri 10:32] =>  0:08
:END:
* DONE 修改GTD文件中的中文星期显示为英文
CLOSED: [2022-04-08 Fri 11:01]
:LOGBOOK:
CLOCK: [2022-04-08 Fri 10:42]--[2022-04-08 Fri 11:01] =>  0:19
:END:
* DONE 博客：总结链表、队列、栈的数据结构
CLOSED: [2022-04-08 Fri 20:47] SCHEDULED: <2022-04-08 Fri 10:00>
:LOGBOOK:
CLOCK: [2022-04-08 Fri 15:55]--[2022-04-08 Fri 18:05] =>  2:10
CLOCK: [2022-04-08 Fri 14:33]--[2022-04-08 Fri 15:37] =>  1:04
CLOCK: [2022-04-08 Fri 13:05]--[2022-04-08 Fri 13:17] =>  0:12
CLOCK: [2022-04-08 Fri 11:51]--[2022-04-08 Fri 12:01] =>  0:10
:END:
* DONE 玩玩 GTA-V
CLOSED: [2022-04-09 Sat 17:07]
:LOGBOOK:
CLOCK: [2022-04-09 Sat 14:22]--[2022-04-09 Sat 15:07] =>  0:45
:END:
* DONE 给妈妈买防晒霜和精华
CLOSED: [2022-04-11 Mon 11:05]
* DONE 寻找电脑录音/视频的软件
CLOSED: [2022-04-11 Mon 11:54]
:LOGBOOK:
- State "DONE"       from "CANCELLED"  [2022-04-18 Mon 12:01]
:END:

* DONE 帮大哥写批量替换的脚本
CLOSED: [2022-04-13 Wed 13:58]
:LOGBOOK:
CLOCK: [2022-04-12 Tue 20:30]--[2022-04-12 Tue 22:58] =>  2:28
CLOCK: [2022-04-12 Tue 14:53]--[2022-04-12 Tue 16:39] =>  1:46
CLOCK: [2022-04-12 Tue 11:22]--[2022-04-12 Tue 12:05] =>  0:43
CLOCK: [2022-04-11 Mon 22:20]--[2022-04-12 Tue 00:33] =>  2:13
:END:
* DONE C算法：队列和栈的实现
CLOSED: [2022-04-07 Thu 21:33]
 :LOGBOOK:
  CLOCK: [2022-04-07 Thu 20:29]--[2022-04-07 Thu 21:33] =>  1:04
  CLOCK: [2022-04-07 Thu 18:00]--[2022-04-07 Thu 18:11] =>  0:11
  CLOCK: [2022-04-07 Thu 17:15]--[2022-04-07 Thu 17:34] =>  0:19
  CLOCK: [2022-04-06 Wed 21:00]--[2022-04-06 Wed 22:07] =>  1:07
  CLOCK: [2022-04-06 Wed 17:52]--[2022-04-06 Wed 18:07] =>  0:15
 :END:
* DONE 普通话练习：白杨礼赞前半段
CLOSED: [2022-04-12 Tue 11:19] DEADLINE: <2022-04-11 Mon 23:00>
:LOGBOOK:
CLOCK: [2022-04-11 Mon 21:26]--[2022-04-11 Mon 22:01] =>  0:35
:END:
* DONE "定时欠费提醒"COSMIC编写
CLOSED: [2022-04-18 Mon 11:35] DEADLINE: <2022-04-13 Wed 22:00>
:LOGBOOK:
CLOCK: [2022-04-14 Thu 09:34]--[2022-04-14 Thu 10:24] =>  0:50
CLOCK: [2022-04-13 Wed 15:59]--[2022-04-13 Wed 18:05] =>  2:06
CLOCK: [2022-04-13 Wed 14:10]--[2022-04-13 Wed 14:22] =>  0:12
:END:
* DONE 理发
CLOSED: [2022-04-14 Thu 13:00] DEADLINE: <2022-04-13 Wed 20:00>
* DONE 健身房锻炼0419
CLOSED: [2022-04-19 Tue 21:24]
* DONE 健身房锻炼0420
CLOSED: [2022-04-20 Wed 22:22]
:LOGBOOK:
- State "DONE"       from "WAITING"    [2022-04-20 Wed 22:22]
:END:
* DONE 计费通用流量统付问题测试
CLOSED: [2022-04-22 Fri 13:05]
:LOGBOOK:
CLOCK: [2022-04-22 Fri 10:25]--[2022-04-22 Fri 11:56] =>  1:31
CLOCK: [2022-04-21 Thu 15:11]--[2022-04-21 Thu 18:45] =>  3:34
CLOCK: [2022-04-21 Thu 10:15]--[2022-04-21 Thu 14:48] =>  4:33
:END:
* DONE 买牙膏和洗衣液
CLOSED: [2022-04-22 Fri 23:27]
* DONE 4月差旅1报销(1000+2500)
CLOSED: [2022-04-23 Sat 10:46]
:LOGBOOK:
CLOCK: [2022-04-23 Sat 10:12]--[2022-04-23 Sat 10:46] =>  0:34
CLOCK: [2022-04-22 Fri 15:33]--[2022-04-22 Fri 15:58] =>  0:25
:END:
* DONE 体验不同版本的manjaro
CLOSED: [2022-04-23 Sat 11:14]
:LOGBOOK:
CLOCK: [2022-04-23 Sat 10:46]--[2022-04-23 Sat 11:14] =>  0:28
CLOCK: [2022-04-23 Sat 10:01]--[2022-04-23 Sat 10:10] =>  0:09
:END:
* DONE 了解相机知识
CLOSED: [2022-04-27 Wed 10:50]
:LOGBOOK:
CLOCK: [2022-04-26 Tue 15:36]--[2022-04-26 Tue 16:24] =>  0:48
:END:
* DONE 贴4月差旅1报销单
CLOSED: [2022-04-27 Wed 15:44]
* DONE 测试333:关系类型40-45后置修改和删除不生效的问题
CLOSED: [2022-04-28 Thu 17:50]
:LOGBOOK:
CLOCK: [2022-04-28 Thu 14:48]--[2022-04-28 Thu 17:08] =>  2:20
CLOCK: [2022-04-28 Thu 11:27]--[2022-04-28 Thu 12:00] =>  0:33
CLOCK: [2022-04-27 Wed 15:45]--[2022-04-27 Wed 18:10] =>  2:25
:END:
* NEXT 信/管知识库环境准备
:LOGBOOK:
CLOCK: [2022-04-24 Sun 20:40]--[2022-04-24 Sun 21:21] =>  0:41
CLOCK: [2022-04-22 Fri 16:16]--[2022-04-22 Fri 16:44] =>  0:28
CLOCK: [2022-04-22 Fri 16:02]--[2022-04-22 Fri 16:10] =>  0:08
:END:
- [X] 安装linux虚拟机
* NEXT 个人GTD系统设计编码
:LOGBOOK:
CLOCK: [2022-04-27 Wed 10:50]--[2022-04-27 Wed 11:47] =>  0:57
CLOCK: [2022-04-19 Tue 22:03]--[2022-04-19 Tue 22:19] =>  0:16
CLOCK: [2022-04-19 Tue 16:56]--[2022-04-19 Tue 18:55] =>  1:59
CLOCK: [2022-04-19 Tue 16:37]--[2022-04-19 Tue 16:50] =>  0:13
CLOCK: [2022-04-19 Tue 14:30]--[2022-04-19 Tue 15:45] =>  1:15
CLOCK: [2022-04-19 Tue 09:06]--[2022-04-19 Tue 09:57] =>  0:51
:END:
- [X] 整体规划的意识还是不到位
- 链接 Todo 和 Someday 里面的属于项目的内容到 Project 的项目中
- Todo.org 中只能有 TODO/NEXT/DONE 状态
- 迁移规则：
  - 切换为 DEFFERED 状态时，迁移到 Someday.org 中
  - Todo.org中的待办如果有子项目，迁移到Project.org中并修改状态为 PROJ
  - 子项目全部完成后后，父项目状态切换为DONE
- 项目文件中子项目链接到主项目中
- 视图：项目视图
- ★根据log生成当天的report
- 根据时间的视图：周视图、月视图.. 时间按照 上午、下午、晚上来划分
  - 设置新的 property: PERIODS
